htmlized-src/erlang/counter.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>counter.org</title>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">&#35745;&#25968;&#22120;,&#24182;&#34892;&#31034;&#20363;</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2011-11-12 &#20845;</span>
<span class="org-meta-line">#+DESCRIPTION:&#35745;&#25968;&#22120;,&#24182;&#34892;&#31034;&#20363;
#+KEYWORDS: erlang
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+FILETAGS: @Erlang
</span><span class="org-block-begin-line">#+begin_src erlang
</span><span class="org-block">  -module(counter).
  -export([start/0,loop/1,increment/1,value/1,stop/1]).

  %% First the interface functions.
  start() -&gt;
      spawn(counter, loop, [0]).

  increment(Counter) -&gt;
      Counter ! increment.

  value(Counter) -&gt;
      Counter ! {self(),value},
      receive
          {Counter,Value} -&gt;
              Value
      end.

  stop(Counter) -&gt;
      Counter ! stop.

  %% The counter loop.
  loop(Val) -&gt;
      receive
          increment -&gt;
              loop(Val + 1);
          {From,value} -&gt;
              From ! {self(),Val},
              loop(Val);
          stop -&gt;                  % No recursive call here
              true;
          Other -&gt;                 % All other messages
              loop(Val)
      end.

  %% P1=counter:start().
  %% counter:increment(P1).
  %% counter:value(P1).

</span><span class="org-block-end-line">#+end_src
</span></pre>
  </body>
</html>
